evgmolt/Tonometer/gd32f303_v1/src/main.c
                    for (int i = 0; i < total_size; i++)
                    {
                        Detect(first_max, i);
                    }
                    
                    for (int i = 0; i < AVER_SIZE; i++) 
                    {
                        ArrayForAver[i] = 0;
                    }
                
                    ILI9341_FillRectangle(SYS_DIA_LEFT, SYS_TOP, 180, 106, ILI9341_WHITE);
                    ILI9341_FillRectangle(SYS_DIA_LEFT, DIA_TOP, 180, 106, ILI9341_WHITE);
                    ILI9341_FillRectangle(PULSE_LEFT, PULSE_TOP, 123, 64, ILI9341_WHITE);    
                
                    memset(EnvelopeArray, 0, MAIN_ARRAY_SIZE);
                    GetArrayOfWaveIndexes(pressure_pulsation_array, puls_buff, puls_buff_NEW);
                    f_sorting_MAX();
                    CountEnvelopeArray(puls_buff_NEW,puls_buff_AMP);
                    GetSysDia();
                    CountPulse();    
                    bonus_byte=0;
                    if (//main_index>1000 & 
                        PSys > MIN_SYS & 
                        PSys < MAX_SYS & 
                        PDia > MIN_DIA & 
                        PDia < MAX_DIA & 
                        puls_out > MIN_PULSE & 
                        puls_out < MAX_PULSE) 
                    {
                        PrintSYS_label(true);
                        PrintDIA_label(true);    
                        PrintSYS(PSys);
                        PrintDIA(PDia);                                    
                        print_num_H((int16_t)puls_out, BIG_NUM_RIGHT, PULSE_TOP, BLACK);

                        if (arrhythmia) PrintHeartX3(true);
                    
                        cur_tim = rtc_counter_get();
                        m_hh = cur_tim / 3600;
                        m_mm = (cur_tim % 3600) / 60;
                        m_ss = (cur_tim % 3600) % 60;
                        check_backup_register(&cur_day, &cur_month, &cur_year);
                        if     (cur_year>=255)    cur_year-=2000;
                    }
                    else 
                    {
                        bonus_byte|=0x80;
                        PrintError(ERROR_MEAS);                            
                    }
                    send_result_measurement((uint8_t)cur_day, (uint8_t)cur_month, (uint8_t)cur_year, (uint8_t)m_ss, (uint8_t)m_mm, (uint8_t)m_hh, (uint8_t)PSys, (uint8_t)PDia, (uint8_t)puls_out,bonus_byte);
                    
                    VALVE_FAST_OPEN;
                    VALVE_SLOW_OPEN;
                    mode = SEND_SAVE_BUFF_MSG;   
//                        mode = INIT_START;
                }                    
                break;
            case SEND_SAVE_BUFF_MSG:
                shutdown_counter = 0;
                break;
        }
        
        if (UART0_flag==1){                    
            for (int w=0;w<200;w++)
            {
                if (finder_msg(UART0_buff))
                {                                                                    
                        ILI9341_FillRectangle(1, 1, 100, 100, ILI9341_RED);                                                            
                }
                if (finder(UART0_buff, "OFF",0,&num_string)) 
                {
                        ILI9341_FillRectangle(1, 1, 100, 100, ILI9341_WHITE);
                }
            }
            UART0_flag=0;
        }
        
        if (show_heart)
        {             
            PrintHeart(true);
            show_heart = false;
        }
        
        if (erase_heart)
        {
            PrintHeart(false);
            erase_heart = false;
        }
                    
        if (0U == cdc_acm_check_ready(&usbd_cdc)) 
        {
            cdc_acm_data_receive(&usbd_cdc);
        } 
        else 
        {
            cdc_acm_data_send(&usbd_cdc);
        }            
    }
}

void AbortMeas(void) 
{
    mode = START_SCREEN;
    PUMP_OFF;
    VALVE_FAST_OPEN;
    VALVE_SLOW_OPEN;
    button_released = 0;
    button_pressed_counter = 0;
}

void i2c_config(void){
        /* enable GPIOB clock */
    rcu_periph_clock_enable(RCU_GPIOB);
        /* enable I2C0 clock */
    rcu_periph_clock_enable(RCU_I2C0);
    
      /* connect PB6 to I2C0_SCL */
    /* connect PB7 to I2C0_SDA */
//  gpio_init(GPIOB, GPIO_MODE_AF_OD, GPIO_OSPEED_50MHZ, GPIO_PIN_6 | GPIO_PIN_7);
        gpio_init(GPIOB, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_6 | GPIO_PIN_7);
    
    /* cofigure I2C clock */
    i2c_clock_config(I2C0, 100000, I2C_DTCY_2);
    /* cofigure I2C address */
    i2c_mode_addr_config(I2C0, I2C_I2CMODE_ENABLE, I2C_ADDFORMAT_7BITS, I2C0_OWN_ADDRESS7);
    /* enable I2C0 */
    i2c_enable(I2C0);
    /* enable acknowledge */
    i2c_ack_config(I2C0, I2C_ACK_ENABLE);
}

void SIM_recieve_OK(void){
    usbd_ep_send (&usbd_cdc, CDC_IN_EP, "OK", 3);
}

void ADS1115_config(uint8_t pointer, uint8_t byte1, uint8_t byte2){
        /* wait until I2C bus is idle */
    while(i2c_flag_get(I2C0, I2C_FLAG_I2CBSY));
    /* send a start condition to I2C bus */
    i2c_start_on_bus(I2C0);
    /* wait until SBSEND bit is set */
    while(!i2c_flag_get(I2C0, I2C_FLAG_SBSEND));
        
        /* send slave address to I2C bus */
    i2c_master_addressing(I2C0, I2C0_SLAVE_ADDRESS7, I2C_TRANSMITTER);
    /* wait until ADDSEND bit is set */
    while(!i2c_flag_get(I2C0, I2C_FLAG_ADDSEND));
    /* clear ADDSEND bit */
    i2c_flag_clear(I2C0, I2C_FLAG_ADDSEND);
    /* wait until the transmit data buffer is empty */
    while(!i2c_flag_get(I2C0, I2C_FLAG_TBE));        

        i2c_data_transmit(I2C0,pointer); //0x01);
        while(!i2c_flag_get(I2C0, I2C_FLAG_TBE)){}
        i2c_data_transmit(I2C0, byte1); //0x8F);
        while(!i2c_flag_get(I2C0, I2C_FLAG_TBE)){}                
        i2c_data_transmit(I2C0, byte2); //0xA3);
        while(!i2c_flag_get(I2C0, I2C_FLAG_TBE)){}        
        
    /* send a stop condition to I2C bus */
    i2c_stop_on_bus(I2C0);
    /* wait until stop condition generate */
    while(I2C_CTL0(I2C0) & 0x0200);                
}

