evgmolt/Tonometer/gd32f303_v1/src/main.c
uint8_t ADS1115_read_IT(void){
        if (gpio_input_bit_get(GPIOB, GPIO_PIN_10)==0)
        {
            while(i2c_flag_get(I2C0, I2C_FLAG_I2CBSY));
            /* send a start condition to I2C bus */
            i2c_start_on_bus(I2C0);
            /* wait until SBSEND bit is set */
            while(!i2c_flag_get(I2C0, I2C_FLAG_SBSEND));        
            /* send slave address to I2C bus */
            i2c_master_addressing(I2C0, I2C0_SLAVE_ADDRESS7, I2C_TRANSMITTER);
            /* wait until ADDSEND bit is set */
            while(!i2c_flag_get(I2C0, I2C_FLAG_ADDSEND));
            /* clear ADDSEND bit */
            i2c_flag_clear(I2C0, I2C_FLAG_ADDSEND);
            /* wait until the transmit data buffer is empty */
            while(!i2c_flag_get(I2C0, I2C_FLAG_TBE));        

            i2c_data_transmit(I2C0, 0x00);
            while(!i2c_flag_get(I2C0, I2C_FLAG_TBE)){}    
            
            /* send a stop condition to I2C bus */
            i2c_stop_on_bus(I2C0);
            /* wait until stop condition generate */
            while(I2C_CTL0(I2C0) & 0x0200);    
        /* wait until I2C bus is idle */    
            while(i2c_flag_get(I2C0, I2C_FLAG_I2CBSY));        ///////////////////////////////////////////////////////////////////////////
            i2c_start_on_bus(I2C0);                                         
            /* wait until SBSEND bit is set */
            while(!i2c_flag_get(I2C0, I2C_FLAG_SBSEND));            
            /* send slave address to I2C bus */
            i2c_master_addressing(I2C0, I2C0_SLAVE_ADDRESS7, I2C_RECEIVER);
            /* wait until ADDSEND bit is set */
            while(!i2c_flag_get(I2C0, I2C_FLAG_ADDSEND));
            /* clear ADDSEND bit */
            i2c_flag_clear(I2C0, I2C_FLAG_ADDSEND);        
            
            /* wait until the RBNE bit is set */
            while(!i2c_flag_get(I2C0, I2C_FLAG_RBNE));
            /* read a data from I2C_DATA */
            i2c_receiver[0] = i2c_data_receive(I2C0);
            
            /* wait until the RBNE bit is set */
            while(!i2c_flag_get(I2C0, I2C_FLAG_RBNE));
            /* read a data from I2C_DATA */
            i2c_receiver[1] = i2c_data_receive(I2C0);
            
            while(!i2c_flag_get(I2C0, I2C_FLAG_BTC));
            /* disable acknowledge */
            i2c_ack_config(I2C0, I2C_ACK_DISABLE);
                            
            /* send a stop condition to I2C bus */
            i2c_stop_on_bus(I2C0);
            /* wait until stop condition generate */
            while(I2C_CTL0(I2C0) & 0x0200);
            /* enable acknowledge */
            i2c_ack_config(I2C0, I2C_ACK_ENABLE);        
            
            ADS1115_config(0b00000001, Hi_ADS1115_config, Lo_ADS1115_config);
            
            return 1;
        }
        return 0;
}

void i2c_convers(void){    
        while(i2c_flag_get(I2C0, I2C_FLAG_I2CBSY));
    /* send a start condition to I2C bus */
    i2c_start_on_bus(I2C0);
    /* wait until SBSEND bit is set */
    while(!i2c_flag_get(I2C0, I2C_FLAG_SBSEND));        
        /* send slave address to I2C bus */
    i2c_master_addressing(I2C0, I2C0_SLAVE_ADDRESS7, I2C_TRANSMITTER);
    /* wait until ADDSEND bit is set */
    while(!i2c_flag_get(I2C0, I2C_FLAG_ADDSEND));
    /* clear ADDSEND bit */
    i2c_flag_clear(I2C0, I2C_FLAG_ADDSEND);
    /* wait until the transmit data buffer is empty */
    while(!i2c_flag_get(I2C0, I2C_FLAG_TBE));        

        i2c_data_transmit(I2C0, 0x00);
        while(!i2c_flag_get(I2C0, I2C_FLAG_TBE)){}    
        
    /* send a stop condition to I2C bus */
    i2c_stop_on_bus(I2C0);
    /* wait until stop condition generate */
    while(I2C_CTL0(I2C0) & 0x0200);    
    /* wait until I2C bus is idle */
    while(i2c_flag_get(I2C0, I2C_FLAG_I2CBSY));
        i2c_start_on_bus(I2C0);                                         ///////////////////////////////////////////////////////////////////////////
    /* wait until SBSEND bit is set */
    while(!i2c_flag_get(I2C0, I2C_FLAG_SBSEND));            
        /* send slave address to I2C bus */
        i2c_master_addressing(I2C0, I2C0_SLAVE_ADDRESS7, I2C_RECEIVER);
        /* wait until ADDSEND bit is set */
    while(!i2c_flag_get(I2C0, I2C_FLAG_ADDSEND));
    /* clear ADDSEND bit */
    i2c_flag_clear(I2C0, I2C_FLAG_ADDSEND);        
        
        /* wait until the RBNE bit is set */
        while(!i2c_flag_get(I2C0, I2C_FLAG_RBNE));
    /* read a data from I2C_DATA */
    i2c_receiver[0] = i2c_data_receive(I2C0);
        
        /* wait until the RBNE bit is set */
        while(!i2c_flag_get(I2C0, I2C_FLAG_RBNE));
    /* read a data from I2C_DATA */
    i2c_receiver[1] = i2c_data_receive(I2C0);
        
        while(!i2c_flag_get(I2C0, I2C_FLAG_BTC));
    /* disable acknowledge */
    i2c_ack_config(I2C0, I2C_ACK_DISABLE);
                        
        /* send a stop condition to I2C bus */
    i2c_stop_on_bus(I2C0);
    /* wait until stop condition generate */
    while(I2C_CTL0(I2C0) & 0x0200);
    /* enable acknowledge */
    i2c_ack_config(I2C0, I2C_ACK_ENABLE);
//        i2c_transmitter[1]=0x01;
            
        /* wait until I2C bus is idle */
    while(i2c_flag_get(I2C0, I2C_FLAG_I2CBSY));
    /* send a start condition to I2C bus */
    i2c_start_on_bus(I2C0);
    /* wait until SBSEND bit is set */
    while(!i2c_flag_get(I2C0, I2C_FLAG_SBSEND));
        
        /* send slave address to I2C bus */
    i2c_master_addressing(I2C0, I2C0_SLAVE_ADDRESS7, I2C_TRANSMITTER);
    /* wait until ADDSEND bit is set */
    while(!i2c_flag_get(I2C0, I2C_FLAG_ADDSEND));
    /* clear ADDSEND bit */
    i2c_flag_clear(I2C0, I2C_FLAG_ADDSEND);
    /* wait until the transmit data buffer is empty */
    while(!i2c_flag_get(I2C0, I2C_FLAG_TBE));        

        i2c_data_transmit(I2C0, 0x01);
        while(!i2c_flag_get(I2C0, I2C_FLAG_TBE)){}
        i2c_data_transmit(I2C0, 0x8F);
        while(!i2c_flag_get(I2C0, I2C_FLAG_TBE)){}                
        i2c_data_transmit(I2C0,0xC3);//0x83);//0xC3);// 0xA3);
        while(!i2c_flag_get(I2C0, I2C_FLAG_TBE)){}        
        
    /* send a stop condition to I2C bus */
    i2c_stop_on_bus(I2C0);
    /* wait until stop condition generate */
    while(I2C_CTL0(I2C0) & 0x0200);    
}

void GPIO_config(void)
{
    rcu_periph_clock_enable(RCU_GPIOB);        
    gpio_init(GPIOB, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_0);  //POWER_ON_DETECT
    gpio_init(GPIOB, GPIO_MODE_IPU, GPIO_OSPEED_50MHZ, GPIO_PIN_10);         //ADS_RDY  --EXTI
    gpio_init(GPIOB, GPIO_MODE_IPU, GPIO_OSPEED_50MHZ, GPIO_PIN_8);          // STDBY
    gpio_init(GPIOB, GPIO_MODE_IPU, GPIO_OSPEED_50MHZ, GPIO_PIN_9);          // CHRG

    rcu_periph_clock_enable(RCU_GPIOC);
    gpio_init(GPIOC, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_0);  //SIM_EXT
    gpio_init(GPIOC, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_1);       //SIM_PWKEY
    gpio_init(GPIOC, GPIO_MODE_IPD, GPIO_OSPEED_50MHZ, GPIO_PIN_8);          //KEY IN
    gpio_init(GPIOC, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_9);       //POWER_ON
    gpio_init(GPIOC, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, GPIO_PIN_10); //USB_ON    
    gpio_init(GPIOC, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_11);      //COMP_ON/OFF
    gpio_init(GPIOC, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_12);      //VALVE1_OP/CL
    gpio_init(GPIOC, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_13);      //VALVE2_OP/CL            
}

void ADC_rcu_config(void)
{
    /* enable GPIOA clock */
    rcu_periph_clock_enable(RCU_GPIOB);
    /* enable ADC0 clock */
    rcu_periph_clock_enable(RCU_ADC0);
    /* enable DMA0 clock */
    rcu_periph_clock_enable(RCU_DMA0);
    /* config ADC clock */
    rcu_adc_clock_config(RCU_CKADC_CKAPB2_DIV8);
}

void ADC_gpio_config(void)
{
    /* config the GPIO as analog mode */
    gpio_init(GPIOB, GPIO_MODE_AIN, GPIO_OSPEED_50MHZ, GPIO_PIN_1);
}

