evgmolt/Tonometer/gd32f303_v1/src/main.c
    /* configure button pin as input */
    //gpio_init(GPIOC, GPIO_MODE_IPD, GPIO_OSPEED_50MHZ, GPIO_PIN_8);
    
    /* enable the AF clock */
    rcu_periph_clock_enable(RCU_AF);    
    
    /* enable and set key user EXTI interrupt to the lowest priority */
        nvic_priority_group_set(NVIC_PRIGROUP_PRE2_SUB2);
    nvic_irq_enable(EXTI5_9_IRQn, 2U, 2U);

    /* connect key user EXTI line to key GPIO pin */
    gpio_exti_source_select(GPIO_PORT_SOURCE_GPIOC, GPIO_PIN_SOURCE_8);

    /* configure key user EXTI line */
    exti_init(EXTI_8, EXTI_INTERRUPT, EXTI_TRIG_BOTH );
    exti_interrupt_flag_clear(EXTI_8);
}

void DeviceOff(void)
{
    PUMP_OFF;
    VALVE_FAST_OPEN;
    VALVE_SLOW_OPEN;
    ILI9341_FillScreen(ILI9341_BLACK);
    gpio_bit_reset(GPIOC, GPIO_PIN_9);
}

void i2cCalibration(void)
{
    i2c_out_K=0;
    for (int g=0;g<20;g++)
    {
        while (ADS1115_read_IT()==0){}
        i2c_out_K+=((i2c_receiver[0]<<8)&0xFF00)+(i2c_receiver[1]&0xFF);                
    }
    i2c_out_K = i2c_out_K/20;
}

void usb_send_i2c_convers(void)
{
    i2c_convers();    
    uint8_t send_buff[3]={25,i2c_receiver[1],i2c_receiver[0]};
    i2c_out=(((i2c_receiver[0]<<8)&0xFF00)+(i2c_receiver[1]&0xFF)-i2c_out_K);
    current_pressure=i2c_out/rate;
    usbd_ep_send (&usbd_cdc, CDC_IN_EP, send_buff, 3);
}


short int convert_save_16(void)
{            
    if (ADS1115_read_IT()==0) return 0;
    pressure_array[main_index]= (((i2c_receiver[0]<<8)&0xFF00)+(i2c_receiver[1]&0xFF)-i2c_out_K);
    if (pressure_array[main_index] < 0) pressure_array[main_index] = 0;
    main_index++;            
    return 1;
}

short int convert_NO_save(void)
{
    if (ADS1115_read_IT()==0) return 0;
    i2c_out=(((i2c_receiver[0]<<8)&0xFF00)+(i2c_receiver[1]&0xFF)-i2c_out_K);
    current_pressure=i2c_out/rate;    
    return i2c_out;
}

void usb_send_16(short int T1, short int T2)
{
    uint8_t send_H1=(T1>>8)&0xFF;
    uint8_t send_L1=T1&0xFF;
    uint8_t send_H2=(T2>>8)&0xFF;
    uint8_t send_L2=T2&0xFF;
    uint8_t send_buff[5]={25,send_L1,send_H1,send_L2,send_H2};
    usbd_ep_send (&usbd_cdc, CDC_IN_EP, send_buff, 5);
}

void BootMode(void)
{
    if (gpio_input_bit_get(GPIOB, GPIO_PIN_0))
    {
        delay_1ms(10);
        if (gpio_input_bit_get(GPIOC, GPIO_PIN_8))
        {
            gpio_bit_set(GPIOC, GPIO_PIN_9);    
            mode = INIT_START;
        }
        else if (gpio_input_bit_get(GPIOC, GPIO_PIN_10))
        {
            //gpio_bit_set(GPIOC, GPIO_PIN_9);    
            mode = USB_CHARGING;
        }
    }
}

void BluetoothCheck(void)
{ 
    if (finder(UART0_buff,"OK",0,0)) 
    {
        if (bluetooth_status == CONNECTED) 
        {
            bluetooth_status = DISCONNECTED;
            PrintBluetooth(true);
        }
    }
    else 
    {
        if (bluetooth_status == DISCONNECTED) 
        {
            PrintBluetooth(false);
            bluetooth_status = CONNECTED;    
        }
    }
//    my_send_string_UART_0("AT\0\n",strlen("AT\0\n"));            
}

uint8_t finder(uint8_t *buff, uint8_t *_string, uint8_t _char, uint16_t *num)
{    
    uint8_t _flag=0;
    for (int j=0;j<200;j++)
    {
        if (buff[j]==_string[0])
        {
            _flag=1;
            for (int k=0;k<strlen(_string);k++)
            {
                if (buff[j+k]!=_string[k]) \
                {
                    _flag=0;
                    k=strlen(_string);
                }                                    
            }                        
        }
        if (_flag) {
                *num=j;
                buff[j]=_char;
                return 1;
        }
    }
    return 0;
}

uint8_t finder_msg(uint8_t *buff)
{    
    uint8_t _flag=0;
    uint8_t _string[20]={'0','2'};

    //ILI9341_WriteString(1, 30, _string, Font_11x18, ILI9341_RED, ILI9341_WHITE);
    for (int j=0;j<200;j++)
    {
        if (buff[j]==_string[0] & buff[j+1]==_string[1])
        {
            _flag=1;                                                
        }
        if (_flag) 
        {
            if (buff[j+2]==0x04)
            {
                uint8_t check_sum=0;
                for (int a=0;a<10;a++)
                {
                    check_sum+=buff[j+a];
                }                                
                if (buff[j+10]==check_sum)
                {
                    SERIAL[2] = buff[j+3];
                    SERIAL[3] = buff[j+4];
                    SERIAL[4] = buff[j+5];
                    SERIAL[5] = buff[j+6];
                    SERIAL[6] = buff[j+7];
                    SERIAL[7] = buff[j+8];
                    SERIAL[8] = buff[j+9];
                    
                    FmcProgramSerial();                        
                
                    buff[j]=0xFF;
                
                    delay_1ms(200);                                    
                    DeviceOff();
                
                    return 1;
                }
            }
            else if (buff[j+2]==0x03)
            {
                uint8_t check_sum=0;
                for (int a=0;a<10;a++)
                {
                    check_sum+=buff[j+a];
                }                                
                if (buff[j+10]==check_sum){
                    cur_day=cur_month=cur_month=cur_year=cur_tss=cur_tmm=cur_thh=0;
                    cur_day=(uint16_t)buff[j+3];
                    cur_month=(uint16_t)buff[j+4];
                    cur_year=(uint16_t)(2000+buff[j+5]);
                    cur_tss=(uint32_t)buff[j+6];
                    cur_tmm=(uint32_t)buff[j+7];
                    cur_thh=(uint32_t)buff[j+8];    
                
                    TimeSet((uint32_t)cur_thh,(uint32_t)cur_tmm,(uint32_t)cur_tss);
                    write_backup_register((uint16_t)cur_day, (uint16_t)cur_month, (uint16_t)cur_year);
                
                    buff[j]=0xFF;
                    return 2;                    }
            }
        }
    }
    return 0;
}

